import Slider from "react-slick";
import { ReviewSliderCard } from "./ReviewSliderCard";
import { forwardRef } from "react";

const reviews = [
  {
    id: 1,
    text: "Мала можливість спробувати кухню вашого закладу та побувати у вас протягом 2 днів. Вражень багато: великий вибір, смачна кухня, уважний та ввічливий персонал. Чистенько та надзвичайно атмосферно! Ваш готель заслуговує на найкращі рекомендації!!! Дякую за високий рівень обслуговування клієнтів!",
    impression: "Відмінно",
  },
  {
    id: 2,
    text: "комфортні світлі номери, розташування супер, 10 хв прогулянки і ти в центрі, чудовий ресторан на 8 поверсі, смачні сніданки з прекрасним краєвидом загальне враження: Відмінно",
    impression: "Відмінно",
  },
  {
    id: 3,
    text: "Нещодавно відвідала цей ресторан і залишилась у повному захваті! З перших хвилин відчувається увага до деталей та щире бажання подарувати гостям приємні емоції. Особливо хочу відзначити роботу хостеса Максима. Його ввічливість, доброзичливість і щира усмішка створили теплу атмосферу з самого початку.Максим професійно та швидко допоміг із вибором столика, врахував наші побажання Обов’язково повернуся ще не раз! Сервіс: 5/5",
    impression: "",
  },
  {
    id: 4,
    text: "Ми святкували річницю весілля, і це був неймовірний вечір, який ми не забудемо! Враження почались ще з порогу – нас приязно зустріли та провели до столику. Інтер'єр створював відчуття справжньої гармонії кольорів, дуже креативне поєднання рослин в залі.Обслуговування на високому рівні – офіціанти уважні, приємні, але не нав'язливі.Особливо хочеться відзначити кухню – страви були дуже смачно приготовлені, особливо сподобався перець Раміро! Ми спробували як європейські, так і українські страви, і кожна з них залишила нас в захваті. Місце ідеальне для особливих подій!",
    impression: "",
  },
];



export const ReviewSlider = forwardRef<Slider>((_, ref) => {
  const settings = {
    infinite: true,
    speed: 500,
    rows: 1,
    slidesToShow: 3,
    variableWidth: true,
    slidesToScroll: 1,
  };
  return (
    <div className="flex flex-col items-end justify-end">
      <div className="grid grid-cols-[1852px] h-[458px] border border-[#B3B3B3] ">
        <div className="slider-contain ">
          <Slider {...settings} ref={ref}>
            {reviews.map((el) => (
              <ReviewSliderCard
                impression={el.impression}
                text={el.text}
                key={el.id}
              />
            ))}
          </Slider>
        </div>
      </div>
    </div>
  );
}
)